/* automatically generated by rust-bindgen 0.72.1 */

pub const _IOC_NRBITS: u32 = 8;
pub const _IOC_TYPEBITS: u32 = 8;
pub const _IOC_SIZEBITS: u32 = 14;
pub const _IOC_DIRBITS: u32 = 2;
pub const _IOC_NRMASK: u32 = 255;
pub const _IOC_TYPEMASK: u32 = 255;
pub const _IOC_SIZEMASK: u32 = 16383;
pub const _IOC_DIRMASK: u32 = 3;
pub const _IOC_NRSHIFT: u32 = 0;
pub const _IOC_TYPESHIFT: u32 = 8;
pub const _IOC_SIZESHIFT: u32 = 16;
pub const _IOC_DIRSHIFT: u32 = 30;
pub const _IOC_NONE: u32 = 0;
pub const _IOC_WRITE: u32 = 1;
pub const _IOC_READ: u32 = 2;
pub const IOC_IN: u32 = 1073741824;
pub const IOC_OUT: u32 = 2147483648;
pub const IOC_INOUT: u32 = 3221225472;
pub const IOCSIZE_MASK: u32 = 1073676288;
pub const IOCSIZE_SHIFT: u32 = 16;
pub const IOC_MAGIC: u8 = 100u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ioctl_cmd {
    pub reg: ::std::os::raw::c_uint,
    pub offset: ::std::os::raw::c_uint,
    pub val: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ioctl_cmd"][::std::mem::size_of::<ioctl_cmd>() - 12usize];
    ["Alignment of ioctl_cmd"][::std::mem::align_of::<ioctl_cmd>() - 4usize];
    ["Offset of field: ioctl_cmd::reg"][::std::mem::offset_of!(ioctl_cmd, reg) - 0usize];
    ["Offset of field: ioctl_cmd::offset"][::std::mem::offset_of!(ioctl_cmd, offset) - 4usize];
    ["Offset of field: ioctl_cmd::val"][::std::mem::offset_of!(ioctl_cmd, val) - 8usize];
};
pub const IOCTL_VALSET: _bindgen_ty_1 = 1074553857;
pub const IOCTL_VALGET: _bindgen_ty_1 = 2148295682;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
